In [1]:
import pandas as pd

data = [[1, '2015-01-01', 10], [2, '2015-01-02', 25], [3, '2015-01-03', 20], [4, '2015-01-04', 30]]
weather = pd.DataFrame(data, columns=['id', 'recordDate', 'temperature']).astype({'id':'Int64', 'recordDate':'datetime64[ns]', 'temperature':'Int64'})

In [2]:
weather

   id recordDate  temperature
0   1 2015-01-01           10
1   2 2015-01-02           25
2   3 2015-01-03           20
3   4 2015-01-04           30

Write a solution to find all dates' id with higher temperatures compared to its previous dates (yesterday).

Return the result table in any order.

The result format is in the following example.

| id |
|----|
| 2  |
| 4  |

In [12]:
weather["yesterday"]=weather["recordDate"]-pd.tseries.offsets.Day(1)
weather

   id recordDate  temperature  yesterday
0   1 2015-01-01           10 2014-12-31
1   2 2015-01-02           25 2015-01-01
2   3 2015-01-03           20 2015-01-02
3   4 2015-01-04           30 2015-01-03

In [17]:
weather_2=weather.merge(right=weather, how="left", left_on="yesterday", right_on="recordDate")
weather_2

,id_x,recordDate_x,temperature_x,yesterday_x,id_y,recordDate_y,temperature_y,yesterday_y
0,1,2015-01-01,10,2014-12-31,<NA>,NaT,<NA>,NaT
1,2,2015-01-02,25,2015-01-01,1,2015-01-01,10,2014-12-31
2,3,2015-01-03,20,2015-01-02,2,2015-01-02,25,2015-01-01
3,4,2015-01-04,30,2015-01-03,3,2015-01-03,20,2015-01-02

In [19]:
weather_2[(weather_2["temperature_x"]>weather_2["temperature_y"])][["id_x"]].rename(columns={"id_x":"id"})

   id
1   2
3   4

In [31]:
weather.sort_values(by='recordDate',inplace=True)
weather

   id recordDate  temperature  yesterday
0   1 2015-01-01           10 2014-12-31
1   2 2015-01-02           25 2015-01-01
2   3 2015-01-03           20 2015-01-02
3   4 2015-01-04           30 2015-01-03

In [28]:
weather['temperature'].diff()

0    <NA>
1      15
2      -5
3      10
Name: temperature, dtype: Int64

In [33]:
weather['recordDate'].diff().dt.days

0    NaN
1    1.0
2    1.0
3    1.0
Name: recordDate, dtype: float64

In [34]:
weather[(weather['temperature'].diff()>0) & (weather['recordDate'].diff().dt.days == 1)]

   id recordDate  temperature  yesterday
1   2 2015-01-02           25 2015-01-01
3   4 2015-01-04           30 2015-01-03